<?php
##############################################Обработка кода################################################################

/*
//Запись связей в таблицу
//$сц_законсть=mysql_query("INSERT INTO moral_izm (z,p,d,u,sc,v) VALUES ('".$z[$запуск]."','".$p[$запуск]."','".$d[$запуск]."','".$u[$запуск]."','".$сц_сер."','".$data."')");

if(substr($функция,0,2)=='if'){$if++;$prizakr[$xm]='if';$xm++;}
if(substr($функция,0,5)=='while'){$wh++;$prizakr[$xm]='wh';$xm++;}
if($функция=='function')
{

$fu++;
$prizakr[$xm]='if';
$xm++;
}
debug_print_backtrace (); 
Ввод 
1)Количество новых перемнных
2)Сами данные
3)Действие шаблона
//Использование команд с целью оптимизации,исправления ошибок скриптов,создания скриптов
Функция скриптов в преобразовании информации на основе обучения!(текст) и перебора! 
Частности:Логика PHP
Если функция не нужна,то ёё удалить
Функции строятся на основе знаний,которые преобразуются в логику,которая затем сохраняется в структуре обработки информации и новых знаний
Для этого нужно установить хотя бы слаюую расширяющуюся часть между ними.Расширение канала понимания и развития будет зависеть от развития самого
кода и его основ
php.php
Содержит структуру обрабатывающую код
Структура должна развивать сама себя
while,if,function
*/
##############################################Функции изменения кода##############################################

//Команды скрипта:
//1)Создание,редактирование,удаление функции из скрипта под определённым индексом
//2)Создание,редактирование,удаление входных в функцию данных  под индексом функции и номером данного в функции
//3)Создание,удаление операнда
//4)Создание,редактирование условия операнда под индексом операнда
//Пример функции funcii('substr',1,2,3)
//Входные данные
//function vxdannie()
//{
//$izm=0;
//1)Определить из памяти количество входных данных и их формат
//2)
//return '0';
//};
#$ps[$n][$sk][$za] --$n-номер по прядку $sk -номер внутренней скобки $za-номер входной переменной
//Функции 1-название создаваемой функции 2-команда 3-номер функции 4-номер скобок
/*Действие
$kom=2;
$izm='strlen';
$in=3;
$dex=0;

//echo '?&'.$f1n['4']['0'];
switch($kom)// переключающее выражение
{
   case 1: // Создание
   $php=substr($php,0,$адрес[$f1n[$in][$dex]])."\n".nper($put).'='.$izm.'('.vxdannie().');'.substr($php,$адрес[$f1n[$in][$dex]]);
   break;
   case 2: // Удаление
   $php=substr($php,0,$адрес[$f1n[$in-1][$dex]]).substr($php,$адрес[$f1n[$in+1][$dex]]);
   //А если ин-1 или ин +1 не определено?
   break;
   case 3: //Изменение
   $php=substr($php,0,$адрес[$f1n[$in-1][$dex]]).substr($php,$адрес[$f1n[$in+1][$dex]]);
   //А если ин-1 или ин +1 не определено?
   break;
}
//deistv_izm_log

//Структура операндов
//include('php/include.php');//Обработка
/*^^^^^^  Исследование ^^^^^^^^*/
//0) Защита от посторонних изменений
//$md5=mysql_query("UPDATE files SET md5='".md5($php)."' WHERE p='".mysql_real_escape_string(substr($str,strlen($_SERVER['DOCUMENT_ROOT'].'\\privet\\')-1))."';");
//1)////////////Сохранение именений///////////////////
//$fp=fopen($str,"w");
//fwrite($fp,$php);
//fclose($fp);
//2)////////////Проверка на ошибки///////////////////
//$resul=phpresult($str);#Запись результатов в таблицу chandge //Добавляет время
?>